---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator.#ctor
source: html/e8eed8ad-8cf5-5caa-c6a8-33159d8e1020.htm
---
# Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public MEPBuildingConstructionSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.